In [1]:
# ============================== EDA Packages ===========================================
# 1) Pandas : Dataframe Application
# 2) Numpy: Numerical Python(All Math Operations)
# 3) Matplotlib: Used for plotting
# 4) Seaborn : Used for plotting
# 5) Plotly : Used for plotting
# 6) Bokhe: Used for plotting
#============================== Machine Learning Packages =============================
# 7) Scikit-learn: sklearn
#============================== Deep Learning Packages =================================
# 8) Tensorflow : Developed by Google
# 9) Keras : Developed by Google
# 10) Pytorch: Developed by Facebook / Meta
#============================== NLP Packages ==========================================
# 11) NLTK: Natural Language Tool Kit
# 12) Scipy : 
#============================== BERT Model Packages ======================================
# 13) Transformers : Developed by Hugging face (Taken over by Google)
#================================ Google Models ==========================================
# 14) Specific Goole Packages
#================================ Azure ML===============================================
# 15) Azure Packages
#================================ GenAI ================================================
# 16) Gemini : Google
# 17) ChatGPT : OpenAI
#================================ LangChain ===========================================
# 18) LangChain Packages

# Create a Dataframe using List

- list === Dictionary
- Dictionary === list

$Step-1$

**Create a empty DataFrame**

In [2]:
import pandas as pd
pd.DataFrame() # empty dataframe with no rows and no columns

Empty DataFrame
Columns: []
Index: []

$Step-2$

**Provide the Data**

In [3]:
names = ['Ayush', 'Abhinas', 'Aakash']
pd.DataFrame(names)

         0
0    Ayush
1  Abhinas
2   Aakash

In [4]:
names = ['Ayush', 'Abhinas', 'Aakash']
age = [20, 25, 30]
pd.DataFrame(zip(names, age))
# First Argument is Data
# Second Argument is Index in DataFrame()

         0   1
0    Ayush  20
1  Abhinas  25
2   Aakash  30

In [5]:
FirstNames = ['Ayush', 'Abhinas', 'Aakash']
city = ['Hyd', 'Blr', 'Chennai']
age = [20, 25, 30]
pd.DataFrame(zip(FirstNames, age, city))

         0   1        2
0    Ayush  20      Hyd
1  Abhinas  25      Blr
2   Aakash  30  Chennai

**Note: all  the list passed inside zip should be of same dimension**

In [6]:
FirstNames = ['Ayush', 'Abhinas', 'Aakash']
city = ['Hyd', 'Blr', 'Chennai']
age = [20, 25, 30]
pd.DataFrame(zip(FirstNames, age), city)

               0   1
Hyd        Ayush  20
Blr      Abhinas  25
Chennai   Aakash  30

$Step-3$

**Provide the Column Names**

In [7]:
names = ['Ayush', 'Abhinas', 'Aakash']
age = [20, 25, 30]
pd.DataFrame(zip(names, age), columns=['Name', 'Age'])

      Name  Age
0    Ayush   20
1  Abhinas   25
2   Aakash   30

In [8]:
names = ['Ayush', 'Abhinas', 'Aakash']
city = ['Hyd', 'Blr', 'Chennai']
age = [20, 25, 30]
pd.DataFrame(zip(names, age, city), columns=['Name', 'Age', 'City'])

      Name  Age     City
0    Ayush   20      Hyd
1  Abhinas   25      Blr
2   Aakash   30  Chennai

In [9]:
names = ['Ayush', 'Abhinas', 'Aakash']
city = ['Hyd', 'Blr', 'Chennai']
age = [20, 25, 30]
data = zip(names, age, city)
cols = ['Name', 'Age', 'City']
df = pd.DataFrame(data, columns=cols)
print(type(df))
df

<class 'pandas.core.frame.DataFrame'>

      Name  Age     City
0    Ayush   20      Hyd
1  Abhinas   25      Blr
2   Aakash   30  Chennai

$Step-4$

**Add a new column to existing DataFrame**

- If you want to add new column 
- First you need to check number of rows in already existing data
- For example in the above dataframe has 3 rows
- Need to create a new new list with 3 rows
- That list equate to the dataframe

In [10]:
job = ['Data Scientis', 'Data Engineer', 'Cyber Security']
df['Jobs'] = job
df

      Name  Age     City            Jobs
0    Ayush   20      Hyd   Data Scientis
1  Abhinas   25      Blr   Data Engineer
2   Aakash   30  Chennai  Cyber Security

$Step-5$

**Modify  value in column**

- Update existing column

In [11]:
df['Age'] = [35, 40, 45]
df

      Name  Age     City            Jobs
0    Ayush   35      Hyd   Data Scientis
1  Abhinas   40      Blr   Data Engineer
2   Aakash   45  Chennai  Cyber Security

$Step-6$

**How to change index**

In [12]:
import pandas as pd
names = ['Ayush', 'Abhinas', 'Aakash', 'Devi']
city = ['Hyd', 'Blr', 'Chennai', "Cuttack"]
age = [20, 25, 30, 26]
data = zip(names, age, city)
cols = ['Name', 'Age', 'City']
idx = ['A', 'B', 'C', 'D']
df = pd.DataFrame(data, index=idx, columns=cols)
df

      Name  Age     City
A    Ayush   20      Hyd
B  Abhinas   25      Blr
C   Aakash   30  Chennai
D     Devi   26  Cuttack

**Note**

- Number of list = **number of columns**
- number of values inside list = **number of rows**
- When you create the dataframe all the list will be of same length

$Step-7$

**shape**

- Gives number or rows and number of columns

In [13]:
df.shape
# Matrix format
# 4 rows and 3 columns
print(f'The number of rows are {df.shape[0]}')
print(f'The number of columns are {df.shape[1]}')

The number of rows are 4
The number of columns are 3

$Step-8$

**Drop the columns**

- In order to drop the column, 3 arguments are required
- **Column Name**
    - The column name we need to mention
- **axis**
    - axis = 0 **represents rows**
    - axis = 1 **represents columns**
- **inplace**
    - we are droping the column means we are modifying the dataframe
    - so this modification we want to save in same variable or different variable
    - If you want to keep modification in same variable then **inplace = True**

In [14]:
df

      Name  Age     City
A    Ayush   20      Hyd
B  Abhinas   25      Blr
C   Aakash   30  Chennai
D     Devi   26  Cuttack

In [15]:
df.drop('City', axis=1, inplace=True)
df

      Name  Age
A    Ayush   20
B  Abhinas   25
C   Aakash   30
D     Devi   26

In [16]:
df1 = df.drop('Age', axis=1) # If Inplace is not true then it will create a new modified DataFrame 
df1

      Name
A    Ayush
B  Abhinas
C   Aakash
D     Devi

In [17]:
df

      Name  Age
A    Ayush   20
B  Abhinas   25
C   Aakash   30
D     Devi   26

In [18]:
import pandas as pd
names = ['Ayush', 'Abhinas', 'Aakash', 'Devi']
city = ['Hyd', 'Blr', 'Chennai', "Cuttack"]
age = [20, 25, 30, 26]
data = zip(names, age, city)
cols = ['Name', 'Age', 'City']
idx = ['A', 'B', 'C', 'D']
df = pd.DataFrame(data, index=idx, columns=cols)
df

      Name  Age     City
A    Ayush   20      Hyd
B  Abhinas   25      Blr
C   Aakash   30  Chennai
D     Devi   26  Cuttack

In [19]:
df.drop('City', axis=1, inplace=True)
df

      Name  Age
A    Ayush   20
B  Abhinas   25
C   Aakash   30
D     Devi   26

In [20]:
df1 = df.drop('Age', axis=1) # If Inplace is not true then it will create a new modified DataFrame 
df1

      Name
A    Ayush
B  Abhinas
C   Aakash
D     Devi

$Step-9$

**Drop multiple columns**

In [21]:
import pandas as pd
names = ['Ayush', 'Abhinas', 'Aakash', 'Devi']
city = ['Hyd', 'Blr', 'Chennai', "Cuttack"]
age = [20, 25, 30, 26]
data = zip(names, age, city)
cols = ['Name', 'Age', 'City']
idx = ['A', 'B', 'C', 'D']
df = pd.DataFrame(data, index=idx, columns=cols)
df

      Name  Age     City
A    Ayush   20      Hyd
B  Abhinas   25      Blr
C   Aakash   30  Chennai
D     Devi   26  Cuttack

In [22]:
df.drop(['Age', 'City'], axis=1, inplace=True)
df

      Name
A    Ayush
B  Abhinas
C   Aakash
D     Devi

$Step-10$

**Drop the rows**

In [23]:
import pandas as pd

names = ['Ayush', 'Abhinas', 'Aakash', 'Devi']
city = ['Hyd', 'Blr', 'Chennai', "Cuttack"]
age = [20, 25, 30, 26]

data = zip(names, age, city)
cols = ['Name', 'Age', 'City']
idx = ['A', 'B', 'C', 'D']

df = pd.DataFrame(data, index=idx, columns=cols)
df

      Name  Age     City
A    Ayush   20      Hyd
B  Abhinas   25      Blr
C   Aakash   30  Chennai
D     Devi   26  Cuttack

In [24]:
df.drop('A', axis=0, inplace=True)
df

      Name  Age     City
B  Abhinas   25      Blr
C   Aakash   30  Chennai
D     Devi   26  Cuttack

$Step-11$

**How to save the dataframe to a file**

- Generally DataFrames are of two types csv, excel
- Similarly DataFrames are save in two common formats csv and excel

In [25]:
import pandas as pd

names = ['Ayush', 'Abhinas', 'Aakash', 'Devi']
city = ['Hyd', 'Blr', 'Chennai', "Cuttack"]
age = [20, 25, 30, 26]

data = zip(names, age, city)
cols = ['Name', 'Age', 'City']
idx = ['A', 'B', 'C', 'D']

df = pd.DataFrame(data, index=idx, columns=cols)
df

      Name  Age     City
A    Ayush   20      Hyd
B  Abhinas   25      Blr
C   Aakash   30  Chennai
D     Devi   26  Cuttack

In [26]:
# File name is data.csv
df.to_csv('resources/data.csv')
#To avoid saving DataFrame index in csv
df.to_csv('resources/data1.csv', index=False)

In [27]:
import pandas as pd

names = ['Ayush', 'Abhinas', 'Aakash', 'Devi']
city = ['Hyd', 'Blr', 'Chennai', "Cuttack"]
age = [20, 25, 30, 26]

data = zip(names, age, city)
cols = ['Name', 'Age', 'City']
idx = ['A', 'B', 'C', 'D']

df = pd.DataFrame(data, index=idx, columns=cols)
df.to_excel('resources/dataExcel.xlsx')
df.to_excel('resources/dataExcel1.xlsx', index=False)